<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"61c9c14f54389a7eecf786fc5a012f646cf7fa47677ccee45f08e8d76042242d","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #952 at https://github.com/cal-itp/data-infra/actions/runs/19241387036","plan_out_hash":"b1f0c09ab02af27bbcd4dfac422650e259017fcc81acbcdb77246a9033f5b611","plan_hash":"c51d31c32dc079bd9d12db17494f6d436d9d33fe4329efe926a55bfc4ee30cd4","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/operators/gcs_to_ckan_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "8BBB2Q==" -> (known after apply)
!~      detect_md5hash      = "acBkOjluXjOyhdfmLuIIdQ==" -> "different hash"
!~      generation          = 1762547827692470 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/gcs_to_ckan_operator.py"
!~      md5hash             = "acBkOjluXjOyhdfmLuIIdQ==" -> (known after apply)
        name                = "plugins/operators/gcs_to_ckan_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #952](https://github.com/cal-itp/data-infra/actions/runs/19241387036)